Mallas/M1/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    FrontAndBack
    {
        type            empty;
    }
    patch1
    {
        type            calculated;
        value           nonuniform List<scalar> 
88
(
1.58615
1.55681
1.54198
1.55332
1.58667
1.62876
1.66722
1.6944
...
)
;
    }
    patch2
    {
        type            calculated;
        value           nonuniform List<scalar> 
88
(
1.58722
1.55712
1.54194
1.55354
1.58619
1.62899
1.66527
1.69156
...
)
;
    }
    patch3
    {
        type            calculated;
        value           nonuniform List<scalar> 
88
(
1.58893
1.55532
1.53784
1.55148
1.58708
1.62952
1.66806
1.69474
...
)
;
    }
    Shaft
    {
        type            calculated;
        value           nonuniform List<scalar> 
18
(
12.2052
12.1534
12.1161
12.0936
12.0861
12.0936
12.1161
12.1534
12.2052
12.2052
12.1534
12.1161
12.0936
12.0861
12.0936
12.1161
12.1534
12.2052
)
;
    }
    Inlet
    {
        type            calculated;
        value           uniform 0;
    }
    Lat-Wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
58
(
1424.87
1477.64
1522.58
1584.12
1933.04
1289.09
1621.02
1631.75
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           uniform 0;
    }
    AMI-St
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI-Rt
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
