Mallas/M1/constant/polyMesh/boundary
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class polyBoundaryMesh;
 location "constant/polyMesh";
 object boundary;
}

(
  FrontAndBack

  {
    type empty;
    physicalType patch;
    nFaces 65756;
    startFace 54858;

  }
  patch1

  {
    type wall;
    physicalType patch;
    nFaces 88;
    startFace 120614;

  }
  patch2

  {
    type wall;
    physicalType patch;
    nFaces 88;
    startFace 120702;

  }
  patch3

  {
    type wall;
    physicalType patch;
    nFaces 88;
    startFace 120790;

  }
  Shaft

  {
    type wall;
    physicalType patch;
    nFaces 18;
    startFace 120878;

  }
  Inlet

  {
    type patch;
    physicalType patch;
    nFaces 29;
    startFace 120896;

  }
  Lat-Wall

  {
    type wall;
    physicalType patch;
    nFaces 58;
    startFace 120925;

  }
  Outlet

  {
    type patch;
    physicalType patch;
    nFaces 29;
    startFace 120983;

  }
  AMI-St

  {
    type cyclicAMI;
neighbourPatch AMI-Rt;
 matchTolerance 1e-4; 
 transform noOrdering;
    physicalType patch;
    nFaces 149;
    startFace 121012;

  }
  AMI-Rt

  {
    type cyclicAMI;
neighbourPatch AMI-St;
 matchTolerance 1e-4; 
 transform noOrdering;
    physicalType patch;
    nFaces 149;
    startFace 121161;

  }
)


// ************************************************************************* //